# Popularty Based Recommender System

In [2]:
# (https://grouplens.org/datasets/movielens/) ml-100k.zip (size: 5 MB)

In [3]:
import pandas as pd

In [11]:
ratings=pd.read_csv("ml-100k/u.data", sep="\t",header=None,names=["user_id","movie_id","rating"],usecols=range(3)) #csv de ki boşluk ya da tab kullanılan alanları seperatörleri düzenler

In [12]:
ratings.head()

   user_id  movie_id  rating
0      196       242       3
1      186       302       3
2       22       377       1
3      244        51       2
4      166       346       1

In [13]:
range(3)

range(0, 3)

In [17]:
movies=pd.read_csv("ml-100k/u.item", sep="|",header=None,encoding="iso-8859-1",names=["movie_id","title"],usecols=range(2)) #csv de ki boşluk ya da tab kullanılan alanları seperatörleri düzenler

In [19]:
movies.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [20]:
ratings=pd.merge(movies,ratings)

In [21]:
ratings.head()

   movie_id             title  user_id  rating
0         1  Toy Story (1995)      308       4
1         1  Toy Story (1995)      287       5
2         1  Toy Story (1995)      148       4
3         1  Toy Story (1995)      280       4
4         1  Toy Story (1995)       66       3

In [23]:
ratings.title.nunique()

1664

In [24]:
import numpy as np

In [25]:
grouped=ratings.groupby("title").agg({"rating":[np.size,np.sum,np.mean]})

In [27]:
grouped.head()

                          rating
                            size  sum      mean
title
'Til There Was You (1997)      9   21  2.333333
1-900 (1994)                   5   13  2.600000
101 Dalmatians (1996)        109  317  2.908257
12 Angry Men (1957)          125  543  4.344000
187 (1997)                    41  124  3.024390

In [28]:
populer=grouped.sort_values(("rating","mean"),ascending=False) #büyükten küçüğe sırala

In [29]:
populer.head()

                                           rating
                                             size sum mean
title
They Made Me a Criminal (1939)                  1   5  5.0
Marlene Dietrich: Shadow and Light (1996)       1   5  5.0
Saint of Fort Washington, The (1993)            2  10  5.0
Someone Else's America (1995)                   1   5  5.0
Star Kid (1997)                                 3  15  5.0

In [30]:
toplam=grouped["rating"]["sum"].sum()

In [32]:
toplam

352986

In [33]:
populer["percentage"]=populer["rating","sum"].div(toplam)*100   #bölme işlemi div

In [34]:
populer.head()

                                           rating          percentage
                                             size sum mean
title
They Made Me a Criminal (1939)                  1   5  5.0   0.001416
Marlene Dietrich: Shadow and Light (1996)       1   5  5.0   0.001416
Saint of Fort Washington, The (1993)            2  10  5.0   0.002833
Someone Else's America (1995)                   1   5  5.0   0.001416
Star Kid (1997)                                 3  15  5.0   0.004249

In [35]:
populer.sort_values(("percentage"),ascending=False)

                                          rating                 percentage
                                            size   sum      mean
title
Star Wars (1977)                             583  2541  4.358491   0.719859
Fargo (1996)                                 508  2111  4.155512   0.598041
Return of the Jedi (1983)                    507  2032  4.007890   0.575660
Contact (1997)                               509  1936  3.803536   0.548464
Raiders of the Lost Ark (1981)               420  1786  4.252381   0.505969
...                                          ...   ...       ...        ...
Getting Away With Murder (1996)                1     1  1.000000   0.000283
The Courtyard (1995)                           1     1  1.000000   0.000283
Promise, The (Versprechen, Das) (1994)         1     1  1.000000   0.000283
JLG/JLG - autoportrait de décembre (1994)      1     1  1.000000   0.000283
Crude Oasis, The (1995)                        1     1  1.000000   0.000283

[1664 rows x 4 columns]